package com.example.textquest;

import android.util.Log;

import java.util.ArrayList;

public class VVRepo implements IRepository {
	String[] locTexts;

	@Override
	public Location getLocation(int id) {
		String[] desc = c(locTexts[id]).split("\\|");
		Action[] actions = new Action[(desc.length - 2) / 2];
		for (int i = 0; i < actions.length; i++) {
			actions[i] = new Action(desc[i + 2], Integer.parseInt(desc[i + 2 + actions.length]));
		}
		return new Location(desc[1], actions);
	}

	public VVRepo() {
		locTexts = makeTexts();
	}

	private String[] makeTexts() {
		ArrayList<String> texts = new ArrayList<>();
		texts.add(" 0|Ôý äý÷ðæêúþ ä ùêóôðç ñðíç. Ïâ éâñâæç äêæïççôóá ù¸òïâá ôõùâ. Ìõæâ ôý ñðëæ¸úþ|ïâ éâñâæ|ä óçíð|1|5");
		texts.add(" 1|Ôý ñðú¸í ïâ éâñâæ. Ñðñâí ñðæ æðèæþ.|Òâóìòðçúþ éðïô|ñðãçèêúþ ä óçíð|2|5");
		texts.add(" 2|Õ ôçãá ïçô éðïôâ. Ïð îðèïð ñðãçåâôþ ñðæ æðèæ¸î, ÿôð ðùçïþ äçóçíð. ×ðùçúþ?|æâ|ïçô|3|5");
		texts.add(
				" 3|Æðèæþ ðìâéýäâçôóá ïçîïðåð ìêóíðôïýî. Ôý ãçéõóñçúïð ñýôâçúþóá óñòáôâôþóá ðô èåõùê÷ ìâñçíþ óòçæê ïçäýóðìê÷ ìðíðóìðä ê ôòâäêïðì.\nÉâôçî ñòêñðíéâçô ùçòçñâ÷â ê ñõóìâçô ôçãá ñðæ óäðë ñâïøêòþ.|Ùôð èç æâíþúç?|4");
		texts.add(" 4|Ôçñçòþ ôý èêä¸úþ ó ùçòçñâ÷âîê! :) Ñðéæòâäíáà.|Ìðïçø|20");
		texts.add(
				" 5|Ôý ñòê÷ðæêúþ ä óçíð. Éæçóþ ìòâóêäð ê ôê÷ð. Óäçòìâçô óðíïýúìð. Ìðóâòþ êæ¸ô ó ìðóðë. Ìõæâ ñðëæçúþ?|æðîðë|ïâ òýïðì|6|14");
		texts.add(
				" 6|Ñòêæá æðîðë, ôý ïâ÷ðæêúþ óäðë éðïô. Ðï ðùçïþ ìóôâôê - äñðíïç äçòðáôïð, ùôð óçåðæïá ñðëæ¸ô æðèæþ.|Äðéþî¸úþ çåð|ñðëæ¸úþ ïâ õíêøõ|13|7");
		texts.add(
				" 7|Ôý äý÷ðæêúþ ïâ õíêøõ ê äêæêúþ, ùôð æðèæþ úñâòêô äðäóà. Íàæê ñòáùõôóá ä õìòýôêá, ïð ê÷ ñçóùâïýç æðîâ îåïðäçïïð òâéîýäâçô.\nÔý äêæêúþ, ùôð ïâ éçîíç íçèâô ïçóìðíþìð ãðíþúê÷ òâìðäêï, ä ìðôðòý÷ õèç òâéîçóôêíêóþ ìâìêç-ôð õîïêìê.|Éâëî¸úþ ðæïõ êé ïê÷|óñòáùçúþóá|10|8");
		texts.add(
				" 8|Ôý óïðäâ äãçåâçúþ ä æðî, ïð ðï ôðèç êé ñçóìâ. Ìòýúâ ðãêíþïð ðóýñâçôóá. Ä÷ðæ õèç éâäâíçï. Ôçãá ñðåòçãâçô ñðæ ñçóìðî...|Æâíþúç|9");
		texts.add(
				" 9|Ðæïâìð ôý ïç ñðåêã æâòðî. Óñõóôá ôýóáùê íçô ôçãá ïâúíê âò÷çðíðåê. Ðïê ñòêïáíê ôçãá éâ æòçäïçåð øâòá âôíâïôðä, ó ùçóôþà ñð÷ðòðïçïïðåð ñðæ óíðçî ñçóìâ, ê ê÷ ïâ÷ðæìâ ñòêðãòçíâ îêòðäõà êéäçóôïðóôþ.\nÔçãá ñòðäðéåíâóêíê øâò¸î! :)|Ìðïçø|20");
		texts.add(
				"10|Ôý éâíçéâçúþ ä òâìðäêïõ ê âììõòâôïð éâìòýäâçúþ óôäðòìõ. Ìðåæâ äðæâ ïâùêïâçô éâ÷í¸óôýäâôþ äïõôòþ, ôý ñð ïçðóôðòðèïðóôê éâûçîíáçúþ óçãç ñâíçø. Ôý ìòêùêúþ, ïð ðô ïç÷äâôìê äðéæõ÷â ôçòáçúþ óðéïâïêç...|Æâíþúç|11");
		texts.add(
				"11|Ïçìðôðòðç äòçîá óñõóôá äçóþ îêò ðãíçôâçô êéäçóôêç ð ïâ÷ðæìç óâîðë ãðíþúðë èçîùõèêïý ä êóôðòêê ùçíðäçùçóôäâ. Âíóõ õñðîêïâçô ç¸ ä ñçóïç \"Äîçóôç ê ïâäóçåæâ\":\n Ê ä ðèêæâïêê óäðçî \n Íçèêúþ èçîùõèêïðë ïâ æïç\n Ïð çóôþ äðíúçãïýç óíðäâ\n Ñðäçòþ îïç, ñðäçòþ îïç...|Æâíþúç|12");
		texts.add("12|Ñðéæòâäíáà, ôý - èçîùõèêïâ!|Ìðïçø|20");
		texts.add(
				"13|Ôý ãçò¸úþ ÿôð ùõæïðç êéðãòçôçïêç ùçíðäçùçóôäâ ê äý÷ðæêúþ ïâ õíêøõ. Õäêæçä, ùôð õ ôçãá çóôþ éðïôêì, óçíþùâïç óãçåâàôóá ì ôçãç - æðèæþ õèç ÷íçûçô äðäóà, òâéîýäâá ê÷ ñçóðùïýç ÷âíõñý. Ðïê ñðæóôõñâàôóá ì ôçãç, ðãòâéõá ñíðôïýë ìðî ùçíðäçùçóìðë ñíðôê...\nÙôð-ôð æâ¸ô ôçãç ñðïáôþ, ùôð äðæâ ñðæïáíâ äâó ê ñðïçóíâ ìõæâ-ôð...\nÔâì ñðáäêíóá ñçòäýë ä îêòç äðíþäðìó êé íàæçë :) Ñðéæòâäíáà!|Ìðïçø|20");
		texts.add(
				"14|Ôý ñòê÷ðæêúþ ïâ òýïðì. Ñð÷ðèç, îçóôïýç ê ïç óðãêòâàôóá óäðòâùêäâôþóá. Ôðòåõàô óçãç, åâíæáô.\nÔäð¸ äïêîâïêç ñòêäíçìâçô óôòâïïðç ôðûçç óõûçóôäð åðíõãðåð øäçôâ. Ñðæðëæá ñðãíêèç, ôý äýáóïáçúþ, ùôð ÿôð ðæêï êé ôç÷ óâîý÷ ìõñøðä-ñòðôðóóðä, ùôð ñòêíçôâàô óàæâ ó ñíâïçôý Âëõò.|Ñðæðëæ¸úþ ì ïçîõ|ñðåõíáçúþ ñð òýïìõ|15|20");
		texts.add(
				"15|Ñòðôðóó ñòçæíâåâçô ôçãç åçïçòâôðò ñíâéîçïïðåð ûêôâ. \nÉçîïý÷ æçïçå çîõ ïç ïõèïð, ïð çåð éâêïôçòçóðäâíâ ôäðá ìðéýòïâá òõãâúìâ! :) \nÎçïáçúþóá|æâ|ïçô|16|20");
		texts.add(
				"16|Ñòðôðóó ñðìâéýäâçô ôçãç, ìâì ïâñòâäíáôþ õóôòðëóôäð ê ùôð ïâèêîâôþ. Ôý óïêîâçúþ òõãâ÷õ ê ðóôâ¸úþóá ä îâëìç ê ñâïâîç, æðäðíþïýë óæçíìðë.|Æâíþúç|17");
		texts.add(
				"17|Äæòõå ôý ðãïâòõèêäâçúþ, ùôð ôõùâ õèç ïâæ åðòðæðî. Çåð ñðòâèâàô ñçòäýç ìâñíê. Íàæê ñâïêìõàô ê ó÷ðæáô ó õîâ. \nÑòðòðì ìòêùêô:\n- Ïç ãðëôçóþ! Êãð ñòêæ¸ô Êéãâäêôçíþ ê õìòðçô äâó ðô ïçîêïõçîðë åêãçíê.\nÔý äìíàùâçúþ ûêô ê ñðìòýäâçúþ êî äó¸ óçíð.|Æâíþúç|18");
		texts.add("18|Äóç óñâóçïý. Ôý ðóôâíóá ùçíðäçìðî); ôçî ïç îçïçç, ÔÝ ÅÇÒÐË! Ñðéæòâäíáà!|Æâíþúç|19");
		texts.add(
				"19|Äïçéâñïð ïâùêïâçôóá æðèæþ. Ñòðôðóó äìíàùâçô ûêô ê ñðìòýäâçô êî óçãá ðæïðåð. Äçóþ ïâòðæ ãçèêô ì ïçîõ ä õìòýôêç.\nÑòðôðóó æðóôâ¸ô ñçòçæâôùêì, ùôð-ôð äðòùêô ä ïçåð...\nÄóç÷ õïðóêô ó Éçîíê...\nÑðæéòâäíáà! Ôçñçòþ äý - äðêïý Âëõòâ!|Ìðïçø|20");
		texts.add(
				"20|--- STAFF ---\n\nHaruki Murakami\nJackie Chan\nSong by Yiruma\n\n(c) Konami, 1985|Ñðñòðãðäâôþ çûç òâé|0");
		
String[] arr = {};
		return texts.toArray(arr);
	}

	private String c(String message) {
		StringBuilder result = new StringBuilder();
		for (char character : message.toCharArray()) {
			if (character >= 'à' && character <= 'ÿ') {
				int newChar = ((int) character - 'à' - 2 + 32) % 32 + 'à';
				result.append((char) (newChar));
			} else if (character >= 'À' && character <= 'ß') {
				int newChar = ((int) character - 'À' - 2 + 32) % 32 + 'À';
				result.append((char) (newChar));
			} else {
				result.append(character);
			}
		}
		Log.d("loc", result.toString());
		return result.toString();
	}
}
